RT-Thread/rt-thread/bsp/nxp/mcx/mcxa/Libraries/MCXA153/MCXA153/drivers/fsl_clock.h
/*! @brief Clock ip name array for AOI. */
#define AOI_CLOCKS      \
    {                   \
        kCLOCK_GateAOI0 \
    }
/*! @brief Clock ip name array for CRC. */
#define CRC_CLOCKS     \
    {                  \
        kCLOCK_GateCRC \
    }
/*! @brief Clock ip name array for CTIMER. */
#define CTIMER_CLOCKS                                              \
    {                                                              \
        kCLOCK_GateCTIMER0, kCLOCK_GateCTIMER1, kCLOCK_GateCTIMER2 \
    }
/*! @brief Clock ip name array for DMA. */
#define DMA_CLOCKS     \
    {                  \
        kCLOCK_GateDMA \
    }
/*! @brief Clock gate name array for EDMA. */
#define EDMA_CLOCKS    \
    {                  \
        kCLOCK_GateDMA \
    }
/*! @brief Clock ip name array for ERM. */
#define ERM_CLOCKS     \
    {                  \
        kCLOCK_GateERM \
    }
/*! @brief Clock ip name array for EIM. */
#define EIM_CLOCKS     \
    {                  \
        kCLOCK_GateEIM \
    }
/*! @brief Clock ip name array for FREQME. */
#define FREQME_CLOCKS     \
    {                     \
        kCLOCK_GateFREQME \
    }
/*! @brief Clock ip name array for GPIO. */
#define GPIO_CLOCKS                                                            \
    {                                                                          \
        kCLOCK_GateGPIO0, kCLOCK_GateGPIO1, kCLOCK_GateGPIO2, kCLOCK_GateGPIO3 \
    }
/*! @brief Clock ip name array for I3C */
#define I3C_CLOCKS      \
    {                   \
        kCLOCK_GateI3C0 \
    }
/*! @brief Clock ip name array for INPUTMUX. */
#define INPUTMUX_CLOCKS      \
    {                        \
        kCLOCK_GateINPUTMUX0 \
    }
/*! @brief Clock ip name array for GPIO. */
#define LPCMP_CLOCKS                     \
    {                                    \
        kCLOCK_GateCMP0, kCLOCK_GateCMP1 \
    }
/*! @brief Clock ip name array for LPADC. */
#define LPADC_CLOCKS    \
    {                   \
        kCLOCK_GateADC0 \
    }
/*! @brief Clock ip name array for LPUART. */
#define LPUART_CLOCKS                                              \
    {                                                              \
        kCLOCK_GateLPUART0, kCLOCK_GateLPUART1, kCLOCK_GateLPUART2 \
    }
/*! @brief Clock ip name array for LPI2C. */
#define LPI2C_CLOCKS      \
    {                     \
        kCLOCK_GateLPI2C0 \
    }
/*! @brief Clock ip name array for LSPI. */
#define LPSPI_CLOCKS                         \
    {                                        \
        kCLOCK_GateLPSPI0, kCLOCK_GateLPSPI1 \
    }
/*! @brief Clock ip name array for MTR. */
#define MTR_CLOCKS     \
    {                  \
        kCLOCK_GateMTR \
    }
/*! @brief Clock ip name array for OSTIMER. */
#define OSTIMER_CLOCKS      \
    {                       \
        kCLOCK_GateOSTIMER0 \
    }

/*! @brief Clock ip name array for PWM. */
#define PWM_CLOCKS                                                  \
    {                                                               \
        {                                                           \
            kCLOCK_GatePWMSM0, kCLOCK_GatePWMSM1, kCLOCK_GatePWMSM2 \
        }                                                           \
    }
/*! @brief Clock ip name array for QDC. */
#define QDC_CLOCKS      \
    {                   \
        kCLOCK_GateQDC0 \
    }
/*! @brief Clock ip name array for UTICK. */
#define UTICK_CLOCKS      \
    {                     \
        kCLOCK_GateUTICK0 \
    }
/*! @brief Clock ip name array for WWDT. */
#define WWDT_CLOCKS      \
    {                    \
        kCLOCK_GateWWDT0 \
    }

/*! @brief Peripherals clock source definition. */
#define BUS_CLK kCLOCK_BusClk

/*! @brief Clock name used to get clock frequency. */
typedef enum _clock_name
{
    kCLOCK_MainClk,    /*!< MAIN_CLK                   */
    kCLOCK_CoreSysClk, /*!< Core/system clock(CPU_CLK) */
    kCLOCK_SYSTEM_CLK, /*!< AHB clock                  */
    kCLOCK_BusClk,     /*!< Bus clock (AHB clock)      */
    kCLOCK_ExtClk,     /*!< External Clock             */
    kCLOCK_FroHf,      /*!< FRO192                     */
    kCLOCK_FroHfDiv,   /*!< Divided by FRO192          */
    kCLOCK_Clk48M,     /*!< CLK48M                     */
    kCLOCK_Fro12M,     /*!< FRO12M                     */
    kCLOCK_Clk1M,      /*!< CLK1M                      */
    kCLOCK_Fro16K,     /*!< FRO16K                     */
    kCLOCK_Clk16K0,    /*!< CLK16K[0]                  */
    kCLOCK_Clk16K1,    /*!< CLK16K[1]                  */
    kCLOCK_SLOW_CLK,   /*!< SYSTEM_CLK divided by 4    */
} clock_name_t;

/*! @brief Clock Mux Switches
 *  The encoding is as follows each connection identified is 32bits wide while 24bits are valuable
 *  starting from LSB upwards
 *
 *  [4 bits for choice, 0 means invalid choice] [8 bits mux ID]*
 *
 */

#define CLK_ATTACH_REG_OFFSET(value) (((uint32_t)(value)) >> 16U)
#define CLK_ATTACH_CLK_SEL(value)    (((uint32_t)(value)) & 0x0000FFFFU)
#define CLK_ATTACH_MUX(reg, sel)     ((((uint32_t)(reg)) << 16U) | (sel))

/*! @brief Clock name used to get clock frequency. */
typedef enum _clock_select_name
{
    kCLOCK_SelI3C0_FCLK = (0x0A0U), /*!< I3C0_FCLK clock selection */
    kCLOCK_SelCTIMER0   = (0x0A8U), /*!< CTIMER0   clock selection */
    kCLOCK_SelCTIMER1   = (0x0B0U), /*!< CTIMER1   clock selection */
    kCLOCK_SelCTIMER2   = (0x0B8U), /*!< CTIMER2   clock selection */
    kCLOCK_SelLPI2C0    = (0x0C8U), /*!< LPI2C0    clock selection */
    kCLOCK_SelLPSPI0    = (0x0D0U), /*!< LPSPI0    clock selection */
    kCLOCK_SelLPSPI1    = (0x0D8U), /*!< LPSPI1    clock selection */
    kCLOCK_SelLPUART0   = (0x0E0U), /*!< LPUART0   clock selection */
    kCLOCK_SelLPUART1   = (0x0E8U), /*!< LPUART1   clock selection */
    kCLOCK_SelLPUART2   = (0x0F0U), /*!< LPUART2   clock selection */
    kCLOCK_SelUSB0      = (0x0F8U), /*!< USB0      clock selection */
    kCLOCK_SelLPTMR0    = (0x100U), /*!< LPTMR0    clock selection */
    kCLOCK_SelOSTIMER0  = (0x108U), /*!< OSTIMER0  clock selection */
    kCLOCK_SelADC0      = (0x110U), /*!< ADC0      clock selection */
    kCLOCK_SelCMP0_RR   = (0x120U), /*!< CMP0_RR   clock selection */
    kCLOCK_SelCMP1_RR   = (0x130U), /*!< CMP1_RR   clock selection */
    kCLOCK_SelTRACE     = (0x138U), /*!< TRACE clock selection     */
    kCLOCK_SelCLKOUT    = (0x140U), /*!< CLKOUT    clock selection */
    kCLOCK_SelSYSTICK   = (0x148U), /*!< SYSTICK   clock selection */
    kCLOCK_SelSCGSCS    = (0x200U), /*!< SCG SCS   clock selection */
    kCLOCK_SelMax       = (0x200U), /*!< MAX       clock selection */
} clock_select_name_t;

/*!
 * @brief The enumerator of clock attach Id.
 */
typedef enum _clock_attach_id
{
    kCLK_IN_to_MAIN_CLK  = CLK_ATTACH_MUX(kCLOCK_SelSCGSCS, 1U), /*!< Attach clk_in to MAIN_CLK.     */
    kFRO12M_to_MAIN_CLK  = CLK_ATTACH_MUX(kCLOCK_SelSCGSCS, 2U), /*!< Attach FRO_12M to MAIN_CLK.    */
    kFRO_HF_to_MAIN_CLK  = CLK_ATTACH_MUX(kCLOCK_SelSCGSCS, 3U), /*!< Attach FRO_HF to MAIN_CLK.     */
    kCLK_16K_to_MAIN_CLK = CLK_ATTACH_MUX(kCLOCK_SelSCGSCS, 4U), /*!< Attach CLK_16K[1] to MAIN_CLK. */
    kNONE_to_MAIN_CLK    = CLK_ATTACH_MUX(kCLOCK_SelSCGSCS, 7U), /*!< Attach NONE to MAIN_CLK.       */

